[net]
subdivisions=8
inputs=2
batch=1
momentum=0.9
decay=0.001
max_batches=2000
time_steps=1
learning_rate=0.1
policy=steps
steps=1000,1500
scales=0.1,0.1

[rnn]
batch_normalize=1
output=1024
hidden=1024
activation=leaky

[rnn]
batch_normalize=1
output=1024
hidden=1024
activation=leaky

[rnn]
batch_normalize=1
output=1024
hidden=1024
activation=leaky

[connected]
output=3  # Adjusted output to represent three digits: XXX (e.g., 123)
activation=linear

[softmax]

[cost]
type=sse

